location = {
    'Арбор': (80, 354), 'Старомест': (258, 425), 'Три башни': (180, 450),
            'Звездопад': (134, 586), 'Айронвуд': (164, 666), 'Солёный берег': (123, 689),
            'Солнечное копьё': (164, 852), 'Принцев перевал': (252, 532), 'Костяной путь': (298, 666),
            'Дорнские марки': (330, 523), 'Хайгарден': (406, 474), 'Штормовой предел': (364, 796),
            'Королевский лес': (451, 806), 'Простор': (404, 540), 'Приморская дорога': (484, 398),
            'Черноводная': (547, 661), 'Королевская гавань': (496, 800), 'Роскошная клешня': (637, 819),
            'Каменная септа': (588, 521), 'Ланииспорт': (645, 443), 'Риверан': (742, 565),
            'Харренхолл': (627, 691), 'Драконий камень': (583, 933), 'Пайк': (798, 309),
            'Сигард': (851, 506), 'Близнецы': (820, 620), 'Лунные горы': (756, 690),
            'Орлиное гнездо': (715, 798), 'Долина Аррен': (834, 828), 'Персты': (862, 730),
            'Ров Кейлия': (908, 599), 'Перешеек': (932, 538), 'Кремневые пальцы': (929, 342),
            'Каменный берег': (1063, 408), 'Винтерфелл': (1087, 585), 'Белая Гавань': (1121, 712),
            'Вдовий дозор': (1087, 854), 'Кархолд': (1257, 855), 'Чёрный замок': (1375, 625)}
print(len(location))